app/views/api/genres/index.json.jbuilder

SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = $1  [["genre_id", 1]]
---
    json.set! genre.name do
        genre.movies.each do |movie|

SELECT  "trailers".* FROM "trailers" WHERE "trailers"."movie_id" = $1 LIMIT $2  [["movie_id", 1], ["LIMIT", 1]]
SELECT  "thumbnails".* FROM "thumbnails" WHERE "thumbnails"."movie_id" = $1 LIMIT $2  [["movie_id", 1], ["LIMIT", 1]]
SELECT  "logos".* FROM "logos" WHERE "logos"."movie_id" = $1 LIMIT $2  [["movie_id", 1], ["LIMIT", 1]]
---
                json.extract! movie, :id, :title, :description, :year, :duration, :maturity_rating, :director, :cast, :genre_id
                json.trailer Trailer.find_by(movie_id: movie&.id).present? ? Trailer.find_by(movie_id: movie&.id)&.url : ""
                json.thumbnail Thumbnail.find_by(movie_id: movie&.id).present? ? Trailer.find_by(movie_id: movie&.id)&.url : ""
                json.logo Logo.find_by(movie_id: movie&.id).present? ? Trailer.find_by(movie_id: movie&.id)&.url : ""